tutorials/multiphase/twoPhaseSpiceDiffusion/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (0.5 0 0)	//N 0
    (1 0 0)	//N 1
    (2 0 0)	//N 2
    (2 0.5 0)	//N 3
    (1 0.5 0)	//N 4
    (0 0.5 0)	//N 5
    (2 2 0)	//N 6
    (1 2 0)	//N 7
    (0 2 0)	//N 8
    (0.5 0 0.5)//N 9
    (1 0 0.5)	//N 10
    (2 0 0.5)	//N 11
    (2 0.5 0.5)//N 12
    (1 0.5 0.5)//N 13
    (0 0.5 0.5)//N 14
    (2 2 0.5)	//N 15
    (1 2 0.5)	//N 16
    (0 2 0.5)	//N 17

    (2 -0.5 0)	//N 18
    (1 -0.5 0)	//N 19
    (0 -0.5 0) 	//N 20
    (2 -2 0) 	//N 21
    (1 -2 0) 	//N 22
    (0 -2 0)	//N 23
    (2 -0.5 0.5)//N 24
    (1 -0.5 0.5)//N 25
    (0 -0.5 0.5)//N 26
    (2 -2 0.5) //N 27
    (1 -2 0.5)	//N 28
    (0 -2 0.5)	//N 29
);

blocks
(
    hex (0 1 4 5 9 10 13 14) (50 50 10) simpleGrading (1 1 1)	  //N 0
    hex (1 2 3 4 10 11 12 13) (50 50 10) simpleGrading (1 1 1)	  //N 1
    hex (4 3 6 7 13 12 15 16) (50 50 10) simpleGrading (1 1 1)	  //N 2
    hex (5 4 7 8 14 13 16 17) (50 50 10) simpleGrading (1 1 1)	  //N 3
    hex (20 19 1 0 26 25 10 9) (50 50 10) simpleGrading (1 1 1)	  //N 4
    hex (23 22 19 20 29 28 25 26) (50 50 10) simpleGrading (1 1 1)//N 5
    hex (22 21 18 19 28 27 24 25) (50 50 10) simpleGrading (1 1 1)//N 6
    hex (19 18 2 1 25 24 11 10) (50 50 10) simpleGrading (1 1 1)  //N 7
);

edges
(
    arc 0 5 (0.353553 0.353553 0)
    arc 9 14 (0.353553 0.353553 0.5)
   
    arc 0 20 (0.353553 -0.353553 0)
    arc 9 26 (0.353553 -0.353553 0.5)

);

boundary
(
    left
    {
        type symmetryPlane;
        faces
        (
            (8 5 14 17)
            (20 23 29 26)

        );
    }

    right
    {
        type wall;
        faces
        (
            (2 3 12 11)
            (3 6 15 12)
            (2 11 24 18)
            (18 24 27 21)
        );
    }

    down
    {
        type wall;
        faces
        (
            (23 22 28 29)
            (22 21 27 28)
        );
    }

    up
    {
        type wall;
        faces
        (
            (7 8 17 16)
            (6 7 16 15)
        );
    }

    hole
    {
        type wall;
        faces
        (
            (5 0 9 14)
            (0 20 26 9)
        );
    }

    frontAndBack
    {
        type wall; //was "empty"
        faces
        (
            (0 5 4 1)
            (1 4 3 2)
            (4 7 6 3)
            (5 8 7 4)
            (9 10 13 14)
            (10 11 12 13)
            (13 12 15 16)
            (14 13 16 17)

            (0 1 19 20)
            (1 2 18 19)
            (19 18 21 22)
            (20 19 22 23)
            (10 9 26 25)
            (11 10 25 24)
            (24 25 28 27)
            (25 26 29 28)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
