tutorials/multiphase/twoPhaseSpiceDiffusion/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    left
    {
        type            symmetryPlane;
    }

    right
    {
        type            zeroGradient;
    }

    down
    {
        type            zeroGradient; 
    }
   
    up
    {
        type            zeroGradient;
    }

    hole
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            zeroGradient; //was "empty"
    }
}

// ************************************************************************* //
