tutorials/multiphase/twoPhaseSpiceDiffusion/0/S
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      S;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
200000
(
0.0154616
0.0152735
0.0150782
0.0148749
0.0146629
0.0144414
0.0142091
0.0139648
...
)
;

boundaryField
{
    left
    {
        type            symmetryPlane;
    }
    right
    {
        type            zeroGradient;
    }
    down
    {
        type            zeroGradient;
    }
    up
    {
        type            zeroGradient;
    }
    hole
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
