tutorials/multiphase/twoPhaseSpiceDiffusion/0/rho1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      rho1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
200000
(
848.34
847.509
846.645
845.747
844.81
843.831
842.804
841.725
...
)
;

boundaryField
{
    left
    {
        type            symmetryPlane;
    }
    right
    {
        type            zeroGradient;
    }
    down
    {
        type            zeroGradient;
    }
    up
    {
        type            zeroGradient;
    }
    hole
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
